Revit 2024 API
PolymeshTopology.GetUVs Method
 Returns all UV coordinates assigned to the polymesh
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<UV> GetUVs()
Visual Basic
Public Function GetUVs As IList(Of UV)
Visual C++
public:
IList<UV^>^ GetUVs()
Return Value
 An array of UV coordinates
See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace